import { Stack } from '@mui/system';
import { Typography } from '@mui/material';

const BoostBenefits = () => {
  return (
    <Stack py={'130px'} bgcolor={'black'} alignItems={'center'}>
      <Stack width={'64vw'}>
        <Typography fontWeight={'bold'} fontSize={'36px'}>
          Що дає буст ММР?
        </Typography>
        <Typography fontSize={'32px'} lineHeight={'32px'}>
          <br />
          Якщо купити буст ММР у професіоналів з досвідом у цій сфері, то можна
          отримати досить велику кількість різноманітних переваг: Підвищення MMR
          у Dota 2 може бути тривалим і трудомістким процесом. Купівля MMR бусту
          дозволяє скоротити кількість часу, необхідного для досягнення бажаного
          рейтингу, оскільки досвідчені гравці, які працюють над цією метою,
          можуть досягати результатів швидше. З підвищенням MMR гравці
          потрапляють у матчі з більш досвідченими та кваліфікованими
          супротивниками, що сприяє їх особистому зростанню та розвитку ігрових
          навичок. MMR буст дозволяє гравцям швидше досягти цього вищого рівня
          гри. Для гравців, які прагнуть брати участь у змагальних заходах або
          просто покращити свої навички в конкурентному середовищі, MMR буст
          може бути корисним інструментом для підготовки. Підвищення рейтингу
          дозволяє їм грати на вищому рівні та вивчати стратегії, застосовувані
          у професійних матчах. Тому замовити буст ММР тут буде оптимальним
          рішенням. Гра на вищих рейтингах зазвичай передбачає більш інтенсивні
          та захоплюючі матчі, які потребують більш просунутих стратегій та
          тактик. Підвищення MMR дозволяє гравцям отримати доступ до цього більш
          захоплюючого ігрового досвіду. На низьких рейтингах гра у Dota 2 може
          бути менш приємною через наявність менш досвідчених або токсичних
          гравців. Купівля MMR бусту дозволяє уникнути цього негативного досвіду
          та відразу почати грати на вищих рейтингах, де ігрове середовище може
          бути більш приємним та професійним.
        </Typography>
      </Stack>
    </Stack>
  );
};
export default BoostBenefits;
